In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [5]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [28]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [29]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [30]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [31]:
Ser1 = pd.Series([1,2,3,4],['USA','GERMANY','USSR','JAPAN'])

In [32]:
Ser1

USA        1
GERMANY    2
USSR       3
JAPAN      4
dtype: int64

In [14]:
import numpy as np
import pandas as pd

In [15]:
from numpy.random import randn

In [16]:
np.random.seed(100)

In [17]:
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [18]:
df

          w         x         y         z
a -1.749765  0.342680  1.153036 -0.252436
b  0.981321  0.514219  0.221180 -1.070043
c -0.189496  0.255001 -0.458027  0.435163
d -0.583595  0.816847  0.672721 -0.104411
e -0.531280  1.029733 -0.438136 -1.118318

In [21]:
df['y']

a    1.153036
b    0.221180
c   -0.458027
d    0.672721
e   -0.438136
Name: y, dtype: float64

In [22]:
newind = 'CA BA DA DD EE'.split()

In [23]:
newind

['CA', 'BA', 'DA', 'DD', 'EE']

In [24]:
df['states'] = newind

In [25]:
df

          w         x         y         z states
a -1.749765  0.342680  1.153036 -0.252436     CA
b  0.981321  0.514219  0.221180 -1.070043     BA
c -0.189496  0.255001 -0.458027  0.435163     DA
d -0.583595  0.816847  0.672721 -0.104411     DD
e -0.531280  1.029733 -0.438136 -1.118318     EE

In [26]:
df.set_index('states')

               w         x         y         z
states
CA     -1.749765  0.342680  1.153036 -0.252436
BA      0.981321  0.514219  0.221180 -1.070043
DA     -0.189496  0.255001 -0.458027  0.435163
DD     -0.583595  0.816847  0.672721 -0.104411
EE     -0.531280  1.029733 -0.438136 -1.118318

In [5]:
import numpy as np
import pandas as pd

In [6]:
d = {'a':[2,4,np.nan],'b':[6,np.nan,np.nan],'c':[2,2,2]}

In [7]:
df = pd.DataFrame(d)

In [9]:
df

     a    b  c
0  2.0  6.0  2
1  4.0  NaN  2
2  NaN  NaN  2

In [10]:
df.dropna()

     a    b  c
0  2.0  6.0  2

In [11]:
df.fillna(value='FILL VALUE')

            a           b  c
0         2.0         6.0  2
1         4.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  2

In [1]:
import numpy as np
import pandas as pd

In [4]:
data = {'company':['GOO','GOO','MST','MST','FB','FB'],
        'person':['sam','charles','amy','David','sarah','John'],
        'Sales':['200','120','130','200','240','350']}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

  company   person Sales
0     GOO      sam   200
1     GOO  charles   120
2     MST      amy   130
3     MST    David   200
4      FB    sarah   240
5      FB     John   350

In [7]:
byComp = df.groupby('company')

In [8]:
byComp.mean()

C:\Users\User\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3444: FutureWarning: Dropping invalid columns in DataFrameGroupBy.mean is deprecated. In a future version, a TypeError will be raised. Before calling .mean, select only columns which should be valid for the function.
  exec(code_obj, self.user_global_ns, self.user_ns)

            Sales
company
FB       120175.0
GOO      100060.0
MST       65100.0

In [9]:
byComp.sum()

             person   Sales
company
FB        sarahJohn  240350
GOO      samcharles  200120
MST        amyDavid  130200

In [11]:
df.groupby('company').min()

          person Sales
company
FB          John   240
GOO      charles   120
MST        David   130

In [12]:
df.groupby('company').describe()

        person                    Sales
         count unique    top freq count unique  top freq
company
FB           2      2  sarah    1     2      2  240    1
GOO          2      2    sam    1     2      2  200    1
MST          2      2    amy    1     2      2  130    1

In [1]:
 import pandas as pd

In [12]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                        'B':['B0','B1','B2','B3'],
                        'C':['C0','C1','C2','C3'],
                        'D':['D0','D1','D2','D3']},
                        index=[1,2,3,4])

In [16]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                       'B':['B4','B5','B6','B7'],
                       'C':['C4','C5','C6','C7'],
                       'D':['D4','D5','D6','D7']},
                       index=[1,2,3,4])

In [17]:
df1

    A   B   C   D
1  A0  B0  C0  D0
2  A1  B1  C1  D1
3  A2  B2  C2  D2
4  A3  B3  C3  D3

In [18]:
df2

    A   B   C   D
1  A4  B4  C4  D4
2  A5  B5  C5  D5
3  A6  B6  C6  D6
4  A7  B7  C7  D7

In [19]:
pd.concat([df1,df2])

    A   B   C   D
1  A0  B0  C0  D0
2  A1  B1  C1  D1
3  A2  B2  C2  D2
4  A3  B3  C3  D3
1  A4  B4  C4  D4
2  A5  B5  C5  D5
3  A6  B6  C6  D6
4  A7  B7  C7  D7

In [23]:
pd.concat([df1,df2],axis=1)

    A   B   C   D   A   B   C   D
1  A0  B0  C0  D0  A4  B4  C4  D4
2  A1  B1  C1  D1  A5  B5  C5  D5
3  A2  B2  C2  D2  A6  B6  C6  D6
4  A3  B3  C3  D3  A7  B7  C7  D7